---
kind: property
id: P:Autodesk.Revit.DB.XYZ.BasisZ
zh: 点
source: html/b4c898a3-d1c7-4655-7b9a-3f139e8db9b1.htm
---
# Autodesk.Revit.DB.XYZ.BasisZ Property

**中文**: 点

The basis of the Z axis.

## Syntax (C#)
```csharp
public static XYZ BasisZ { get; }
```

## Remarks
The basis of the Z axis is the vector (0,0,1), the unit vector on the Z axis.